app/controllers/courses_controller.rb

	def index
        @courses=Course.all
---
SELECT "courses".* FROM "courses" WHERE (name like '%apple%')

    def show
    @course=Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@course=Course.new(course_params)
		if @course.save
---
INSERT INTO "courses" ("name", "teacher", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "2"], ["teacher", "3"], ["time", "4"], ["created_at", "2015-04-06 11:51:48.818984"], ["updated_at", "2015-04-06 11:51:48.818984"]]

    def edit
    @course=Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]

    def update
    @course=Course.find(params[:id])
    if @course.update(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "courses" SET "teacher" = ?, "time" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["teacher", "2"], ["time", "5"], ["updated_at", "2015-04-06 12:04:04.580037"], ["id", 1]]

    def destroy
    	@course=Course.find(params[:id])
    	@course.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]